20221216043133-publish_org_roam.org
#+property: header-args :emacs-lisp
:PROPERTIES:
:ROAM_TAGS: script emacs roam org
:END:
#+title: Publish Org Roam

#+CREATED: [2022-12-17 12:03:14]
#+LAST_MODIFIED: [2023-06-30 Fri 03:44]



* How To Publish org roam notes :org:roam:emacs:

By Defualt org roam notes do not work with ~org-publish~ becuase it doesnt know how to resolve the id links.



