20221216043133-publish_org_roam.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Publish Org Roam</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">programming</a>
    <a href="/hacking" class="navbar-filename">hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Publish Org Roam</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2ab73a1">How To Publish org roam notes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span>&#xa0;<span class="roam">roam</span>&#xa0;<span class="emacs">emacs</span></span></a>
<ul>
<li><a href="#ID-2b069384-79d9-4ed3-bc6e-b766edf526cb">Publish Script</a></li>
<li><a href="#org1436f4d">See also</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ROAM<sub>TAGS</sub>: script emacs roam org
</p>



<div id="outline-container-org2ab73a1" class="outline-2">
<h2 id="org2ab73a1">How To Publish org roam notes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span>&#xa0;<span class="roam">roam</span>&#xa0;<span class="emacs">emacs</span></span></h2>
<div class="outline-text-2" id="text-org2ab73a1">
<p>
By Defualt org roam notes do not work with <code>org-publish</code> becuase it doesnt know how to resolve the id links.
</p>
</div>
